Repository: albacostas/planificadorFecha
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Paragraph36
no: Bruk [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) til å hente og [dekode](glossary://decode) dataene fra lokal lagring.
vi: Sử dụng [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) để truy xuất và [giải mã](glossary://decode) dữ liệu của bạn từ ổ lưu trữ cục bộ.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Page22..Paragraph37
no: [Metoden](glossary://method) `getEventsFileURL` bruker [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) til å hente plasseringen for de lagrede dataene. I dette tilfellet er dataene i appbeholderen i Dokumenter-katalogen. Det er bare appen din som kan lese og skrive til denne plasseringen.
vi: [Phương thức](glossary://method) `getEventsFileURL` sử dụng [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) để truy xuất vị trí của dữ liệu đã lưu trữ. Trong trường hợp này, dữ liệu của bạn ở trong bộ chứa ứng dụng bên trong thư mục Tài liệu. Chỉ ứng dụng của bạn mới có thể đọc và ghi vào vị trí này.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Page23..Paragraph38
no: Når appen kjøres nå, bruker den de forhåndsdefinerte hendelsene i `EventData`. Kan du tenke deg hva som må endres for at appen skal bruke dataene som er lagret i Dokumenter-katalogen i stedet?
vi: Khi ứng dụng của bạn đang chạy, ứng dụng mặc định sử dụng các sự kiện được xác định trước trong `EventData`. Bạn có nghĩ được mình cần thay đổi gì để ứng dụng sử dụng dữ liệu được lưu trữ trong thư mục Tài liệu thay vào đó không?

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Page24..Paragraph39
no: For å kunne bruke de lagrede dataene må du laste dem inn fra Dokumenter-katalogen.
vi: Để sử dụng dữ liệu đã lưu trữ của mình, bạn sẽ cần tải dữ liệu từ thư mục Tài liệu.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Page24..Paragraph40
no: Finn datafilens plassering ved å kalle `EventData.getEventsFileURL()`. Den leter etter filen `events.data` i Dokumenter-katalogen. Siden denne metoden kan føre til en feil, må du plassere den i et `do`-`catch`-uttrykk. Eventuelle feil som oppstår i `do`-klausulen, kan håndteres i `catch`-klausulen.
vi: Lấy vị trí của tệp dữ liệu bằng cách gọi `EventData.getEventsFileURL()`. Lệnh này tìm kiếm một tệp có tên là `events.data` trong thư mục Tài liệu của bạn. Vì phương thức gọi có thể tạo ra lỗi nên bạn cần đặt trong một câu lệnh `do`-`catch`. Bất kỳ lỗi nào được tạo ra trong mệnh đề `do` đều có thể được xử lý trong mệnh đề `catch`.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Page25..Paragraph41
no: Deretter leser du innholdet i filen til minnet som en [data](doc://com.apple.documentation/documentation/foundation/data)-instans. Den inneholder alle de lagrede dataene, men den er fortsatt kodet som JSON.
vi: Tiếp theo, bạn sẽ đọc nội dung của tệp vào bộ nhớ dưới dạng một thể hiện [dữ liệu](doc://com.apple.documentation/documentation/foundation/data). Thể hiện này chứa tất cả dữ liệu đã lưu trữ của bạn, nhưng vẫn được mã hóa dưới dạng JSON.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Page26..Paragraph42
no: Her [dekoder](glossary://decode) [JSONDecoder](doc://com.apple.documentation/documentation/foundation/jsondecoder) dataene og plasserer dem i en matrise med `Event`-instanser, slik at du kan bruke dem i koden din. Hurra!
vi: Tại đây, [JSONDecoder](doc://com.apple.documentation/documentation/foundation/jsondecoder) [giải mã](glossary://decode) dữ liệu thành một dãy các thể hiện `Event`, cho phép bạn sử dụng trong mã của mình. Rất tuyệt vời!

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..Page27..Paragraph43
no: Hvis dataene ikke lastes inn, viser appen hendelsene som er forhåndsutfylt i `EventData`.
vi: Nếu dữ liệu không tải được thì ứng dụng hiển thị các sự kiện được điền trước trong `EventData`.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TasksaveFunc..title
no: Lagre data til lokal lagring
vi: Lưu dữ liệu vào ổ lưu trữ cục bộ

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TasksaveFunc..Paragraph44
no: [Kode](glossary://encode) og lagre dataene dine i lokal lagring.
vi: [Mã hóa](glossary://encode) và lưu trữ dữ liệu của bạn trong ổ lưu trữ cục bộ.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TasksaveFunc..Page28..Paragraph45
no: På samme måten som du dekodet JSDON-dataene før du brukte dem, må du [kode](glossary://encode) dataobjektet til JSON-formatet. [JSONEncoder](doc://com.apple.documentation/documentation/foundation/jsonencoder) koder `events` fra `Event`-typen til JSON.
vi: Cũng giống như cách bạn giải mã dữ liệu JSON trước khi sử dụng, bạn cần [mã hóa](glossary://encode) đối tượng dữ liệu của mình thành định dạng JSON. [JSONEncoder](doc://com.apple.documentation/documentation/foundation/jsonencoder) mã hóa `events` từ kiểu `Event` thành JSON.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TasksaveFunc..Page29..Paragraph46
no: Når dataene er kodet til JSON-formatet, kan du arkivere til lokal lagring ved hjelp av adressen fra `getEventsFileURL`.
vi: Với dữ liệu được mã hóa bằng JSON, bạn có thể lưu vào ổ lưu trữ cục bộ bằng cách sử dụng địa chỉ từ `getEventsFileURL`.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TasksaveFunc..Page29..Paragraph47
no: Siden `write`-metoden kan føre til en feil, må du kalle den ved å plassere `try`-nøkkelordet foran den.
vi: Vì phương thức `write` có thể tạo ra lỗi nên bạn cần gọi phương thức đó bằng cách đặt từ khóa `try` ở phía trước.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TasksaveFunc..Page30..Paragraph48
no: Hvis dataene ikke lastes inn, skal det skrives en melding til konsollen som informerer om at dataene ikke ble arkivert.
vi: Nếu dữ liệu không tải được, hãy in một thông báo đến bảng điều khiển rằng dữ liệu không lưu được.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TasksaveFunc..Page31..Paragraph49
no: Hurra! Nå som du forstår metodene `save()` og `load()`, kan du tilpasse dem for å inkludere persistens i alle apper. Det eneste som gjenstår, er å kalle `save()`- og `load()`-metodene.
vi: Hay lắm! Bây giờ, bạn đã hiểu phương thức `save()` và `load()`, bạn có thể sử dụng những phương thức này và điều chỉnh chúng để thêm tính bền bỉ vào bất kỳ ứng dụng nào. Tất cả những gì còn lại là gọi các phương thức `save()` và `load()`.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..title
no: Kalle metoden last inn og arkiver
vi: Gọi phương thức tải và lưu

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Paragraph50
no: Bruk metodene `load()` og `save()` til å hente inn og arkivere data når noen starter appen og endrer hendelsesdata.
vi: Sử dụng các phương thức `load()` và `save()` để truy xuất và lưu dữ liệu khi có người đang khởi chạy ứng dụng và thực hiện các thay đổi đối với dữ liệu sự kiện.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page32..Paragraph51
no: For å laste inn dataene når appen startes må du registrere når toppnivåvisningen `EventList` vises. Når den vises, kaller du `load()`-metoden. Den metoden laster inn dataene og tildeler dem til den publiserte egenskapen `eventData.events` for å oppdatere hendelseslisten med alle dataene som ble arkivert tidligere.
vi: Để tải dữ liệu của bạn khi ứng dụng khởi chạy, bạn cần phát hiện thời điểm chế độ xem cấp cao nhất, `EventList`, xuất hiện. Khi chế độ xem này xuất hiện, hãy gọi phương thức `load()`. Phương thức sẽ tải dữ liệu và gán vào thuộc tính đã đăng `eventData.events` của bạn, cập nhật danh sách sự kiện với tất cả dữ liệu đã lưu trước đó.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page32..Paragraph52
no: Bruk [task](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:))-modifikatoren til å kalle `load()` asynkront før visningen vises.
vi: Sử dụng trình sửa đổi [tác vụ](doc://com.apple.documentation/documentation/swiftui/view/task(priority:_:)) để gọi `load()` không đồng bộ trước khi chế độ xem xuất hiện.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page32..CodeBlock3
no: .task { eventData.load() }
vi: .task { eventData.load() }

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page33..Paragraph53
no: Selv om du nå laster inn data fra lokal lagring når appen startes, vil det ikke vises data fordi du ikke har arkivert data ennå.
vi: Mặc dù bây giờ bạn đang tải dữ liệu từ ổ lưu trữ cục bộ khi ứng dụng khởi chạy, nhưng bạn sẽ không nhìn thấy dữ liệu hiển thị vì bạn chưa lưu dữ liệu.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page34..Paragraph54
no: Når noen redigerer en hendelse, vil du arkivere dataene, slik at appen kan laste dem inn neste gang den startes.
vi: Khi có người sửa một sự kiện, bạn sẽ muốn lưu dữ liệu để ứng dụng có thể tải trong lần khởi chạy tiếp theo.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page34..Paragraph55
no: Bruk `.onChange(of:)`-modifikatoren til å registrere endringer i `events`, og kall deretter `eventData.save()` for å arkivere endringene:
vi: Sử dụng trình sửa đổi `.onChange(of:)` để phát hiện thời điểm xảy ra các thay đổi đối với `events`, sau đó gọi `eventData.save()` để lưu các thay đổi:

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page34..CodeBlock4
no: .onChange(of: eventData.events) { _ in eventData.save() }
vi: .onChange(of: eventData.events) { _ in eventData.save() }

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadData..Page35..Paragraph56
no: Jippi! Nå har du lagt til persistens. Legg til en ny hendelse og start appen på nytt for å se om dataene fortsatt ligger der.
vi: Tuyệt vời! Bạn đã thêm tính bền bỉ. Hãy thêm một sự kiện mới và khởi chạy lại ứng dụng của bạn để xem dữ liệu của bạn có bền bỉ như dự kiến không.
