Repository: albacostas/planificadorFecha
Catalog: Guide/Resources/*.lproj/Localizable.strings
Languages: no, vi

source: GuideBook..title
no: Planleggingskalender
vi: Trình lập kế hoạch ngày

source: GuideBook..WelcomeMessageExploring the Date Planner App..title
no: Utforske Planleggingskalender-appen
vi: Khám phá ứng dụng Trình lập kế hoạch ngày

source: GuideBook..WelcomeMessageExploring the Date Planner App..Paragraph0
no: Bruk denne appen til å organisere og planlegge en serie med hendelser organisert etter dato.
vi: Sử dụng ứng dụng này để sắp xếp và lập kế hoạch một loạt các sự kiện theo ngày.

source: GuideBook..Guide0..StepDate Planner..title
no: Planleggingskalender
vi: Trình lập kế hoạch ngày

source: GuideBook..Guide0..StepDate Planner..LearningCenterContent..Paragraph1
no: ![](intro.png) Velkommen til appen Planleggingskalender. Bruk denne appen til å organisere og planlegge en serie med hendelser organisert etter dato.
vi: ![](intro.png) Chào mừng đến ứng dụng Trình lập kế hoạch ngày. Sử dụng ứng dụng này để sắp xếp và lập kế hoạch một loạt các sự kiện, được sắp xếp theo ngày.

source: GuideBook..Guide0..StepDate Planner..LearningCenterContent..Paragraph2
no: I dette eksempelet lærer du hvordan du bruker en [observerbar](glossary://observable%20object) datamodell til å opprette dynamiske lister med hendelser, og hvordan du arkiverer dataene mellom appåpninger ved hjelp av data[persistens](glossary://persistence). På tide å sette i gang!
vi: Trong mẫu này, bạn sẽ sử dụng mô hình dữ liệu [có thể quan sát](glossary://observable%20object) để tạo ra các danh sách sự kiện động và tìm hiểu cách lưu trữ dữ liệu giữa các lần khởi chạy ứng dụng với [tính bền bỉ](glossary://persistence) của dữ liệu. Đã đến lúc bắt đầu!

source: GuideBook..Guide0..StepDate Planner..LearningCenterContent..GuideButtonStart Walkthrough..title
no: Start gjennomgangen
vi: Bắt đầu hướng dẫn

source: GuideBook..Guide0..StepDate Planner..LearningCenterContent..GuideButtonStart Walkthrough..description
no: Tilgjengelighetsbeskrivelse for knapp
vi: Mô tả AX cho nút

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..title
no: Forstå datamodellen og opprette dynamiske lister
vi: Tìm hiểu mô hình dữ liệu và tạo ra các danh sách động

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventPlannerApp..title
no: Konfigurering av app
vi: Cấu hình ứng dụng

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventPlannerApp..Paragraph3
no: Opprett et enkelt dataobjekt og gjør det tilgjengelig for hele [visningshierarkiet](glossary://view%20hierarchy) for å finne ut hvordan appen deler data med visningene.
vi: Tìm hiểu cách ứng dụng chia sẻ dữ liệu với các chế độ xem bằng cách tạo ra một đối tượng dữ liệu đơn nhất và cung cấp đối tượng đó cho toàn bộ [phân cấp xem](glossary://view%20hierarchy).

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventPlannerApp..Page0..Paragraph4
no: Appen lagrer dataene ved hjelp av variabelen `eventData`. `eventData` defineres med [egenskapsinnpakningen](glossary://property%20wrapper) `@StateObject` for å opprette en instans av et [observerbart objekt](glossary://observable%20object), `EventData`. Siden dette objektet er observerbart, holder SwiftUI øye med det for å registrere eventuelle endringer i verdiene. Når dataene endres, vil SwiftUI automatisk oppdatere visningene som bruker (eller [observerer](glossary://observer)) det.
vi: Ứng dụng lưu trữ dữ liệu của mình bằng biến `eventData`. `eventData` được định nghĩa bằng [trình đóng gói thuộc tính](glossary://property%20wrapper) `@StateObject` để tạo ra một thể hiện của [đối tượng có thể quan sát](glossary://observable%20object), `EventData`. Vì đối tượng này là loại có thể quan sát nên SwiftUI giám sát đối tượng để theo dõi các thay đổi đối với giá trị. Bất kỳ lúc nào dữ liệu thay đổi, SwiftUI tự động cập nhật các chế độ xem sử dụng (hoặc [quan sát](glossary://observer)) dữ liệu đó.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventPlannerApp..Page1..Paragraph5
no: Deretter overfører koden `eventData` til `EventList`-visningen. For denne appen er `EventList` den første visningen som appen viser når den startes.
vi: Tiếp theo, mã đó chuyển `eventData` vào chế độ xem `EventList`. Đối với ứng dụng này, `EventList` là chế độ xem đầu tiên mà ứng dụng hiển thị khi khởi chạy.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..Taskevent..title
no: Hendelsesmodell
vi: Mô hình sự kiện

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..Taskevent..Paragraph6
no: Hendelsesmodellen inneholder alle data som trengs for å visualisere og organisere hendelsene i listen din. Her utforsker du hvordan du strukturerer en `Event`.
vi: Mô hình sự kiện của bạn lưu giữ tất cả dữ liệu cần thiết để trực quan hóa và sắp xếp các sự kiện trong danh sách của bạn. Tại đây, bạn sẽ khám phá cách cấu trúc một `Event`.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..Taskevent..Page2..Paragraph7
no: For å organisere dataene bruker appen en samling av `Event`-objekter. Hvert av dem representerer en konkret hendelse, for eksempel en campingtur eller en fødselsdagsfest. Ved å følge [protokollen](glossary://protocol) `Identifiable` sørger du for at SwiftUI kan identifisere og oppdatere hver rad når du oppretter en liste med hendelser.
vi: Để sắp xếp dữ liệu, ứng dụng sử dụng một tập hợp các đối tượng `Event`, mỗi đối tượng trong đó biểu thị một sự kiện cụ thể, ví dụ như chuyến đi cắm trại hoặc buổi tiệc sinh nhật. Bằng việc tuân thủ [giao thức](glossary://protocol) `Identifiable`, bạn đảm bảo rằng khi bạn tạo ra một danh sách các sự kiện, SwiftUI có thể nhận dạng và cập nhật từng hàng.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..Taskevent..Page3..Paragraph8
no: `Event`-typen inneholder all informasjon du trenger for å fylle ut en hendelse, inkludert et symbol, en farge, en tittel, en dato og en samling av hendelser. Hver oppgave er et konkret gjøremål for hendelsen, for eksempel «Kjøp en campinglykt».
vi: Loại `Event` chứa tất cả thông tin mà bạn cần để điền vào một sự kiện, bao gồm một biểu tượng, màu, tiêu đề, ngày và tập hợp các tác vụ. Mỗi tác vụ là một mục cần làm cụ thể cho sự kiện, ví dụ như “Lấy đèn cắm trại”.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..Taskevent..Page4..Paragraph9
no: Du ser også en liste med [beregnede egenskaper](glossary://computed%20property) for `Event`. De hjelper personer med å organisere delene av listene deres basert på datoen og antall oppgaver som skal utføres.
vi: Bạn cũng sẽ nhận thấy một danh sách các [thuộc tính được tính toán](glossary://computed%20property) cho `Event`. Những thuộc tính này giúp mọi người sắp xếp các phần trong danh sách của họ dựa trên ngày và số lượng tác vụ sẽ hoàn thành.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventTask..title
no: Hendelsesoppgave
vi: Tác vụ sự kiện

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventTask..Paragraph10
no: En hendelsesoppgave representerer en oppgave som skal utføres for en hendelse. Her lærer du hvordan du modellerer oppgaven.
vi: Một tác vụ sự kiện biểu thị một mục cần làm cho một sự kiện. Tại đây, bạn sẽ tìm hiểu cách lập mô hình các tác vụ.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventTask..Page5..Paragraph11
no: En `EventTask` representerer ett gjøremål fra en samling av gjøremål for en hendelse. I likhet med `Event` er `EventTask` også `Identifiable`, slik at SwiftUI kan administrere og oppdatere utseendet for den i en liste.
vi: Một `EventTask` biểu thị một mục trong tập hợp các mục cần làm cho một sự kiện. Như `Event`, một `EventTask` cũng là `Identifiable`, cho phép SwiftUI quản lý và cập nhật sự xuất hiện trong một danh sách.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventTask..Page6..Paragraph12
no: `EventTask` inneholder egenskaper for tekst, fullførtstatus og en `isNew`-egenskap. Når en person merker en oppgave som fullført, angir du `isCompleted` som `true`, slik at appen kan spore hvilke oppgaver som gjenstår for hver hendelse.
vi: `EventTask` chứa các thuộc tính cho văn bản, trạng thái hoàn thành và một thuộc tính `isNew`. Khi một người đánh dấu một tác vụ là đã hoàn thành, bạn đặt `isCompleted` thành `true`, cho phép ứng dụng của bạn theo dõi các tác vụ còn lại cho từng sự kiện.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventData..title
no: Hendelsesdata
vi: Dữ liệu sự kiện

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventData..Paragraph13
no: Du bruker det [observerbare objektet](glossary://observable%20object) `EventData` til å fylle hendelseslisten med data. Her lærer du hvordan du strukturerer og oppdaterer dataene.
vi: Bạn sử dụng [đối tượng có thể quan sát](glossary://observable%20object) `EventData` để điền dữ liệu trong danh sách sự kiện của mình. Tại đây, bạn sẽ tìm hiểu cách cấu trúc và cập nhật dữ liệu.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventData..Page7..Paragraph14
no: Dette er `EventData`-typen som arkiverer og modifiserer alle hendelsene som appen viser i brukergrensesnittet. `EventData` følger `ObservableObject`-[protokollen](glossary://protocol), noe som betyr at hvis noen av dens [publiserte verdier](glossary://published%20value) endres, varsler SwiftUI alle [observatørene](glossary://observer) (visninger som bruker disse verdiene) og oppdaterer dem automatisk.
vi: Đây là kiểu `EventData`, lưu trữ và sửa đổi tất cả các sự kiện mà ứng dụng của bạn hiển thị trong UI của mình. `EventData` tuân thủ [giao thức](glossary://protocol) `ObservableObject`, nghĩa là nếu có bất kỳ [giá trị đã đăng](glossary://published%20value) nào thay đổi thì SwiftUI thông báo cho tất cả các [trình quan sát](glossary://observer) (các chế độ xem sử dụng các giá trị đó) và cập nhật chúng tự động.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventData..Page8..Paragraph15
no: `EventData` inneholder egenskapen `events`. Den lagrer en forhåndsutfylt matrise med `Event`-verdier, for eksempel en spillkveld eller en legetime. Ved å bruke [egenskapsinnpakningen](glossary://property%20wrapper) `@Published` når du definerer denne egenskapen, gir du SwiftUI beskjed om å varsle alle [observatører](glossary://observer) og oppdatere visningene deres når `events`-matrisen endres. Det gjør at du kan legge til og slette hendelser fra en hendelse og umiddelbart se endringene i brukergrensesnittet.
vi: `EventData` chứa một thuộc tính được gọi là `events` lưu trữ một dãy các giá trị `Event` được điền trước, ví dụ như đêm chơi trò chơi hoặc buổi hẹn với bác sĩ. Bằng việc sử dụng [trình đóng gói thuộc tính](glossary://property%20wrapper) `@Published` khi định nghĩa thuộc tính này, bạn chỉ dẫn SwiftUI thông báo cho tất cả [trình quan sát](glossary://observer) và cập nhật các chế độ xem của chúng bất kỳ lúc nào dãy `events` thay đổi. Việc này cho phép bạn thêm và xóa các sự kiện khỏi dãy và nhìn thấy thay đổi trong UI ngay lập tức.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..title
no: Hendelsesliste
vi: Danh sách sự kiện

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Paragraph16
no: Lær deg hvordan du konstruerer det primære brukergrensesnittet for appen – hendelseslisten – ved hjelp av en [List](doc://com.apple.documentation/documentation/swiftui/list)-visning.
vi: Tìm hiểu cách cấu trúc UI chính cho ứng dụng — danh sách sự kiện — sử dụng một chế độ xem [Danh sách](doc://com.apple.documentation/documentation/swiftui/list).

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page9..Paragraph17
no: `EventList`-visningen oppretter en gruppert liste med hendelser ved hjelp av en `List`-visning.
vi: Chế độ xem `EventList` tạo ra một danh sách các sự kiện được nhóm bằng một chế độ xem `List`.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page10..Paragraph18
no: `DatePlannerApp` overfører det [observerbare objektet](glossary://observable%20object) `eventData` til `EventList` med [egenskapsinnpakningen](glossary://property%20wrapper) `@ObservedObject`. Denne egenskapsinnpakningen gir SwiftUI beskjed om å oppdatere visningen hvis verdien endres.
vi: `DatePlannerApp` chuyển [đối tượng có thể quan sát](glossary://observable%20object) `eventData` vào `EventList` với [trình đóng gói thuộc tính](glossary://property%20wrapper) `@ObservedObject`. Trình đóng gói thuộc tính này thông báo cho SwiftUI cập nhật chế độ xem bất kỳ lúc nào có sự thay đổi đối với giá trị.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page11..Paragraph19
no: Appen bruker en [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) til å navigere mellom forskjellige visninger.
vi: Ứng dụng sử dụng một [NavigationSplitView](doc://com.apple.documentation/documentation/swiftui/navigationsplitview) để điều hướng giữa các chế độ xem khác nhau trong ứng dụng của bạn.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page11..Paragraph20
no: I bredere appkonfigurasjoner, for eksempel liggende i fullskjerm på iPad, viser SwiftUI `NavigationSplitView`-innholdet som flere kolonner ved siden av hverandre i stedet for som én stabel. I denne layouten vises `EventList` i en kolonne i sidepanelet, og målinnholdet vises i primærpanelet.
vi: Trong các cấu hình ứng dụng rộng hơn, như chế độ ngang toàn màn hình trên iPad, SwiftUI hiển thị nội dung `NavigationSplitView` dưới dạng nhiều cột liền kề, thay vì một ngăn xếp đơn nhất. Trong bố cục này, `EventList` hiển thị trong một cột thanh bên và nội dung đích xuất hiện trong khung chính.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page12..Paragraph21
no: Den andre kolonnen viser `EventEditor`-visningen når en person markerer en hendelse i listen. Ellers viser den plassholdervisningen `Text`.
vi: Cột thứ hai hiển thị chế độ xem `EventEditor` khi một người chọn một sự kiện trong danh sách; ngược lại, cột đó hiển thị chế độ xem `Text` trình giữ chỗ.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page13..Paragraph22
no: For å lage listen din oppretter du en `List`-visning og bruker en `ForEach`-løkke for å iterere over alle tidsperiodene (`nextSevenDays`, `nextThirtyDays`, `future` og `past`).
vi: Để lập danh sách của bạn, hãy tạo ra một chế độ xem `List` và sử dụng một vòng lặp `ForEach` để lặp lại trong tất cả các khoảng thời gian (`nextSevenDays`, `nextThirtyDays`, `future` và `past`).

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page14..Paragraph23
no: Når du vet at det er hendelser i et avsnitt, oppretter du en `Section`-visning og bruker `ForEach` for å iterere over alle hendelsene i den tidsperioden. Bruk metoden `sortedEvents(period:)` fra `EventData` for å returnere hendelsene som er spesifikke for avsnittets tidsperiode.
vi: Khi bạn biết có các sự kiện trong một phần, hãy tạo ra một chế độ xem `Section` và sử dụng `ForEach` để lặp lại trên tất cả các sự kiện trong khoảng thời gian đó. Sử dụng phương thức `sortedEvents(period:)` từ `EventData` để trả về các sự kiện cụ thể trong phạm vi thời gian của phần.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page15..Paragraph24
no: Opprett `EventRow`-visninger for hver hendelse i tidsperioden i `ForEach`-løkken.
vi: Bên trong vòng lặp `ForEach`, hãy tạo ra các chế độ xem `EventRow` cho từng sự kiện trong khoảng thời gian.

source: GuideBook..Guide0..StepDate Planner..TaskGroup0..TaskeventList..Page16..Paragraph25
no: For å slette hendelser legger du til modifikatoren `.swipeActions` i hendelsesraden og definerer en knapp som fjerner hendelsen fra `events`-matrisen i `EventData`. Nå kan du sveipe mot venstre på en hendelse og trykke på Slett-knappen for å fjerne den aktuelle hendelsen.
vi: Để xóa các sự kiện, hãy thêm trình sửa đổi `.swipeActions` trên hàng sự kiện và định nghĩa một nút có chức năng xóa sự kiện khỏi dãy `events` trong `EventData`. Bây giờ, bạn có thể vuốt sang trái trên một sự kiện và chạm vào nút Xóa để xóa sự kiện hiện tại.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..title
no: Persistente appdata
vi: Duy trì bền bỉ dữ liệu ứng dụng

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Paragraph26
no: Gjør data [persistente](glossary://persistence) mellom appåpninger ved å gjøre appdata om til et datalagringsformat ved hjelp av Swifts [Codable](doc://com.apple.documentation/documentation/swift/codable)-protokoll.
vi: Duy trì [bền bỉ](glossary://persistence) dữ liệu trong các lần khởi chạy ứng dụng bằng cách chuyển đổi dữ liệu ứng dụng của bạn thành định dạng lưu trữ dữ liệu bằng cách sử dụng giao thức [Codable](doc://com.apple.documentation/documentation/swift/codable) của Swift.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..title
no: Persistente appdata
vi: Duy trì bền bỉ dữ liệu ứng dụng

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page17..Paragraph27
no: Selv om appen kan lagre og publisere oppdateringer av datamodellen i alle relevante visninger, lagrer den ikke disse dataene mellom appåpninger. Det betyr at du mister alle tidligere data hver gang appen starter på nytt. Dette kan du løse ved å bruke [persistens](glossary://persistence) i appen.
vi: Mặc dù ứng dụng của bạn có khả năng lưu trữ và đăng các cập nhật cho mô hình dữ liệu của bạn trên tất cả các chế độ xem liên quan, nhưng ứng dụng không lưu trữ dữ liệu này giữa các lần khởi chạy ứng dụng, nên bạn mất tất cả dữ liệu trước đó mỗi lần ứng dụng khởi động lại. Bạn có thể khắc phục lỗi này bằng cách thêm [tính bền bỉ](glossary://persistence) vào ứng dụng.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page18..Paragraph28
no: Persistens kan brukes på flere måter, for eksempel med [UserDefaults](doc://com.apple.documentation/documentation/foundation/userdefaults), lokal lagring med [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) og [CoreData](doc://com.apple.documentation/documentation/coredata).
vi: Tính bền bỉ có thể xuất hiện bằng nhiều hình thức như [UserDefaults](doc://com.apple.documentation/documentation/foundation/userdefaults), ổ lưu trữ cục bộ với [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) và [CoreData](doc://com.apple.documentation/documentation/coredata).

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page18..Paragraph29
no: `UserDefaults` er et godt alternativ hvis du vil at brukerne skal kunne bruke persistente innstillinger, for eksempel for foretrukket tidsformat. `UserDefaults` er perfekt for å lagre og administrere mindre datamengder. Du kan enkelt lagre `UserDefaults` ved hjelp av egenskapsinnpakningen [AppStorage](doc://com.apple.documentation/documentation/swiftui/appstorage).
vi: `UserDefaults` rất tuyệt vời nếu bạn muốn cho phép mọi người duy trì bền bỉ các tùy chọn của họ, ví dụ như định dạng giờ ưu tiên. `UserDefaults` lý tưởng để lưu trữ và quản lý các khối dữ liệu nhỏ. Bạn có thể lưu trữ đơn giản `UserDefaults` bằng trình đóng gói thuộc tính [AppStorage](doc://com.apple.documentation/documentation/swiftui/appstorage).

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page18..Paragraph30
no: Du kan for eksempel lagre en navneverdi med `name` som `UserDefaults`-nøkkel ved å bruke denne kodesnutten:
vi: Ví dụ: bạn có thể lưu trữ một giá trị tên với `name` dưới dạng khóa `UserDefaults` với đoạn mã này:

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page18..CodeBlock0
no: @AppStorage("name") var name: String = "Blu"
vi: @AppStorage("name") var name: String = "Blu"

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page19..Paragraph31
no: I dette eksperimentet skal du gjøre en matrise med hendelser fra `EventData` persistent. Siden dette er et lite datasett, kan du gjøre det ved å bruke [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) til å lagre dataene lokalt.
vi: Trong thử nghiệm này, bạn sẽ duy trì bền bỉ một dãy các sự kiện từ `EventData`. Vì đây là một tập dữ liệu nhỏ nên bạn có thể đạt được việc này bằng cách sử dụng [FileManager](doc://com.apple.documentation/documentation/foundation/filemanager) để lưu trữ dữ liệu cục bộ.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page19..Paragraph32
no: For større datasett kan [CoreData](doc://com.apple.documentation/documentation/coredata) gi bedre ytelse og støtte for funksjoner som å synkronisere data mellom flere enheter.
vi: Đối với các tập dữ liệu lớn hơn, [CoreData](doc://com.apple.documentation/documentation/coredata) có thể cung cấp hiệu năng và hỗ trợ tốt hơn đối với các tính năng như đồng bộ hóa dữ liệu trên nhiều thiết bị.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page20..Paragraph33
no: Nå skal du få en liten utfordring. For å gjøre hendelsesdataene persistente må du arkivere dem i et datalagringsformat, for eksempel JSON. Men dataene som koden din bruker, er en matrise med `Event`-instanser. Kan du tenke deg hvordan du kan konvertere fra en matrise med `Event`-instanser til JSON for å arkivere dataene dine – og motsatt for å hente dem inn igjen?
vi: Bây giờ là một thử thách nhỏ. Để duy trì bền bỉ dữ liệu sự kiện, bạn sẽ cần lưu dữ liệu bằng một định dạng lưu trữ dữ liệu, ví dụ như JSON. Tuy nhiên, dữ liệu mà mã của bạn sử dụng là một dãy các thể hiện `Event`. Bạn có nghĩ được cách chuyển đổi từ một dãy các thể hiện `Event` thành JSON để lưu dữ liệu — và ngược lại để truy xuất không?

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page20..CodeBlock1
no: var events: [Event] = []
vi: var events: [Event] = []

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page20..CodeBlock2
no: [{ "symbol" : "case.fill", "title" : "Sayulita Trip", "tasks": [...], "date" : [...] }]
vi: [{ "symbol" : "case.fill", "title" : "Sayulita Trip", "tasks": [...], "date" : [...] }]

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page21..Paragraph34
no: Prosessen med å konvertere data til JSON-format kalles [koding](glossary://encode), og når du konverterer dem tilbake fra JSON til data som koden din kan bruke, kalles det [dekoding](glossary://decode). Det eneste du trenger for å konvertere mellom dataformatene, er en koder og en dekoder.
vi: Quá trình chuyển đổi dữ liệu của bạn thành định dạng JSON được gọi là [mã hóa](glossary://encode) và quá trình chuyển đổi ngược lại từ JSON thành dữ liệu mà mã của bạn có thể sử dụng là [giải mã](glossary://decode). Tất cả những gì bạn cần là một trình mã hóa và một trình giải mã để chuyển đổi giữa các định dạng dữ liệu.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..Taskpersistence..Page21..Paragraph35
no: Heldigvis støtter Swift koding og dekoding med [Codable]-protokollen. Hvis typen din, for eksempel `Event`, stemmer overens med `Codable`, kan den kode og dekode til og fra JSON og andre formater. Ta en titt på `Event`-definisjonen for å se hvordan det gjøres.
vi: May mắn là Swift hỗ trợ mã hóa và giải mã bằng giao thức [Codable]. Nếu kiểu của bạn — ví dụ như `Event` — tuân thủ `Codable` thì có thể mã hóa và giải mã qua lại giữa JSON và các định dạng khác. Hãy kiểm tra định nghĩa của `Event` để xem việc này được thực hiện như thế nào.

source: GuideBook..Guide0..StepDate Planner..TaskGroup1..TaskloadFunc..title
no: Last inn data fra lokal lagring
vi: Tải dữ liệu từ ổ lưu trữ cục bộ
